app/controllers/restaurants_controller.rb

  def index
    render json: Restaurant.all
---
SELECT "restaurants".* FROM "restaurants"

  def show
      render json: Restaurant.find(params[:id])
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]