app/controllers/reviews_controller.rb

  def update
    respond_to do |format|
      if @review.update(review_params)
---
UPDATE "reviews" SET "review" = $1, "updated_at" = $2 WHERE "reviews"."id" = $3  [["review", "great restaurant!!!"], ["updated_at", "2018-02-12 15:32:43.878531"], ["id", 1]]